opends/tests/functional-tests/shared/data/dsml/suites/04addmodaddsuite/data/add090.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 1538
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
    <soap-env:Body>
      <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
        <addRequest dn="uid=foo23, ou=People, o=dsmlfe.com">
        <attr name="description">
        <value>This is a sample description.</value>
        </attr>
        <attr name="mail">
        <value>foo23@airius.com</value>
        </attr>
        <attr name="objectclass">
        <value>top</value>
        <value>person</value>
        <value>organizationalPerson</value>
        <value>inetOrgPerson</value>
        </attr>
        <attr name="givenname">
        <value>foo</value>
        </attr>
        <attr name="telephonenumber">
        <value>+1 408 111 1111</value>
        </attr>
        <attr name="cn">
        <value>foo 23</value>
        </attr>
        <attr name="uid">
        <value>foo23</value>
        </attr>
        <attr name="roomnumber">
        <value>43k</value>
        </attr>
        <attr name="sn">
        <value>23</value>
        </attr>
        <attr name="ou">
        <value>People</value>
        </attr>
        <attr name="facsimiletelephonenumber">
        <value>+1 408 111 1111</value>
        </attr>
        <attr name="l">
        <value>foobar</value>
        </attr>
        </addRequest>
      </batchRequest>
    </soap-env:Body>
  </soap-env:Envelope>
